package Java20211213;

public class ConstExam {
    /*
        생성자 constructor : 생성자는 클라스가 객체를 생성할 때 자동으로 객체를 생성하자마자 호출되는 일종의 매서드(완전한 매서드는 아님)
                            기존의 매서드는 매번 객체를 호출했어야 하는데, 이건 알아서 호출함
        특징    1. 생성자는 클래스명과 동일해야만 함
                2. 생성자는 return 타입도 없고 return도 없다 -> InherHouseDong 3번 예제

        기본 생성자 default constructor: 
        특징    1. 아무런 내용, 인수, 매개변수도 없는 이름만 존재하는 생성자 -> InherDog 예제
                2. 무조건 모든 클래스에 존재한다. 생성자를 단 하나도 직접 만들지 않으면 자바가 자동으로 기본생성자를 생성한다.
                    그러나 생성자를 하나라도 개발자가 직접 만들면 그 때는 자바가 기본생성자를 생성하지 않는다.

        생성자 오버로딩 constructor overloading

        일반 매서드의 오버로딩과 마찬가지로 생성자에도 오버로딩을 사용함.
        
    
    */


}
